"""
如何定义一个列表:
    1. 空列表: []
    2. 有内容的列表
        ['A', 'B', 'C']
        [1, 2, 3]
        [3.5, 4.5, 5.5]
        [['A', 'B', 'C'], [1, 2, 3], []]
"""

list1 = []
print(type(list1))  # <class 'list'>

# 获取列表里面的元素(索引and切片)
list2 = ['CPU', '主板', '显卡', '内存', '硬盘', '散热', '电源', '机箱']
print(list2[2])  # 显卡
print(list2[-1])  # 机箱
print(list2[:4])  # ['CPU', '主板', '显卡'] [0,3)
print(list2[4:])  # ['硬盘', '散热', '电源', '机箱']
print(list2[::2])  # ['CPU', '显卡', '硬盘', '电源']
print(list2[::-2])  # ['机箱', '散热', '内存', '主板']
